import matplotlib.pyplot as plt

x1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
y1 = [0.0,0.0,0.0,0.0,0.7,1.2,2.6,3.3,4.6,5.0,5.4,6.0,6.5,7.1,7.6,7.9,8.3,8.6,9.0,9.2,9.9,10.4,10.8,11.6,11.8,12.7,12.9,13.4,13.8,13.9]

x2 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
y2 = [0.0,0.0,0.0,0.0,0.1,0.7,1.1,1.2,1.6,1.9,2.4,2.6,2.8,2.9,3.0,3.4,4.0,4.4,4.7,4.9,5.1,5.4,5.7,5.9,6.0,6.1,6.3,6.5,6.6,6.8]

plt.plot(x1,y1,label='p')  #ระบุ label สำหรับ legend ได้
plt.plot(x2,y2,label='j') # plot กราฟ series ที่สอง
plt.plot(x3,y3,label='l') # plot กราฟ series ที่สอง
plt.xlabel('day') #ชื่อแกน x
plt.ylabel('hight') #ชื่อแกน y
plt.title('ChartTitle1\nChartTitle2') #ชื่อกราฟ ขึ้นบรรทัดใหม่ได้ด้วย \n
plt.legend()  #แสดง Legend
plt.show()  #บรรทัดนี้ใน colab ใส่ก็ได้ ไม่ใส่ก็ได้
