import matplotlib.pyplot as plt

x2 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
y2 = [0.0,0.0,0.0,0.0,0.9,1.3,1.9,2.6,3.1,3.6,4.0,4.6,5.0,6.1,6.4,7.0,7.0,7.2,7.6,7.9,8.3,8.4,8.9,9.2,9.5,9.7,10.1,10.6,11.4,12.1]

x3 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
y3 = [0.0,0.0,0.0,0.0,0.5,1.6,2.2,2.7,3.1,3.5,3.9,4.0,4.4,4.6,4.9,5.0,5.3,5.6,6.0,6.6,6.9,7.0,7.6,8.3,8.4,8.5,8.5,8.6,9.1,9.4]

x4 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
y4 = [0.0,0.0,0.0,0.0,0.1,0.1,0.1,1.0,1.0,1.3,1.5,1.7,1.9,2.2,2.4,2.9,3.5,4.1,4.6,5.0,6.0,6.9,7.8,8.4,9.3,10.4,11.6,12.4,12.5,12.8]

plt.plot(x2,y2,label='coriander') # plot กราฟ series ที่สอง
plt.plot(x3,y3,label='sunflower seedlings') # plot กราฟ series ที่สอง
plt.plot(x4,y4,label='Chinese Kale') # plot กราฟ series ที่สอง
plt.xlabel('day') #ชื่อแกน x
plt.ylabel('hight') #ชื่อแกน y
plt.title('ChartTitle1\nChartTitle2') #ชื่อกราฟ ขึ้นบรรทัดใหม่ได้ด้วย \n
plt.legend()  #แสดง Legend
plt.show()  #บรรทัดนี้ใน colab ใส่ก็ได้ ไม่ใส่ก็ได้