import matplotlib.pyplot as plt

x1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
y1 = [0.0,0.0,0.0,0.0,0.1,0.1,0.1,1.0,1.0,1.3,1.5,1.7,1.9,2.2,2.4,2.9,3.5,4.1,4.6,5.0,6.0,6.9,7.8,8.4,9.3,10.4,11.6,12.4,12.5,12.8]

x2 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
y2 = [0.0,0.0,0.0,0.0,0.0,0.0,0.1,0.3,0.6,0.8,1.0,1.3,1.4,1.6,1.9,2.4,2.8,3.3,3.6,3.7,4.0,4.2,4.7,4.8,5.5,5.9,6.4,7.8,8.3,9.5]


plt.plot(x1,y1,label='p')  #ระบุ label สำหรับ legend ได้
plt.plot(x2,y2,label='j') # plot กราฟ series ที่สอง
plt.plot(x3,y3,label='l') # plot กราฟ series ที่สอง
plt.xlabel('day') #ชื่อแกน x
plt.ylabel('hight') #ชื่อแกน y
plt.title('ChartTitle1\nChartTitle2') #ชื่อกราฟ ขึ้นบรรทัดใหม่ได้ด้วย \n
plt.legend()  #แสดง Legend
plt.show()  #บรรทัดนี้ใน colab ใส่ก็ได้ ไม่ใส่ก็ได้